In [1]:
import pandas as pd
import numpy as np

In [2]:
obj = pd.Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3])

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
obj2 = pd.Series([4,7,-5,3] , index=['d','c','b','a'])

In [7]:
obj2

d    4
c    7
b   -5
a    3
dtype: int64

In [8]:
obj2['a']

3

In [9]:
obj2[obj2 > 0]

d    4
c    7
a    3
dtype: int64

In [10]:
obj2*2

d     8
c    14
b   -10
a     6
dtype: int64

In [11]:
np.exp(obj2)

d      54.598150
c    1096.633158
b       0.006738
a      20.085537
dtype: float64

Another way to think about a Series is as a fixed-length, ordered dict, as it is a mapping of index values to data values. It can be used in many contexts where you might
use a dict

In [12]:
'b' in obj2

True

In [13]:
'e' in obj2

False

In [14]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [15]:
obj3 = pd.Series(sdata)

In [16]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [17]:
states = ['California','Ohio','Oregon','Texas']

In [18]:
obj4 = pd.Series(sdata, index=states)

In [19]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [20]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [22]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

I will practice more working with missing data in more detail in Chapter 7.

In [23]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [26]:
obj4.name = 'population'

In [27]:
obj4.index.name= 'state'

In [28]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [29]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [30]:
## A Serie's can be altered in-place by assignment

In [31]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [32]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

## DataFrame

In [33]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [34]:
frame = pd.DataFrame(data)

In [35]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [36]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [37]:
pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [38]:
frame2 = pd.DataFrame(data, columns=['year','state','pop','debt'],
                     index=['one','two','three','four','five','six'])

In [39]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [40]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [41]:
frame['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [42]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [43]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [44]:
frame2.debt = 18.5

In [45]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  18.5
two    2001    Ohio  1.7  18.5
three  2002    Ohio  3.6  18.5
four   2001  Nevada  2.4  18.5
five   2002  Nevada  2.9  18.5
six    2003  Nevada  3.2  18.5

In [46]:
frame2['debt'] = np.arange(6.)

In [47]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [48]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two','four','five'])

In [49]:
frame2['debt'] = val

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [51]:
frame2['eastern'] = frame2.state == 'Ohio'

In [52]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [53]:
## New Columns cannot be created with the frame2.eastern syntax.
######
# The del method can be used ti remove this column:

In [54]:
del frame2['eastern']

In [55]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [56]:
pop = {'Nevada':{2001: 2.4, 2002:2.9},
      'Ohio':{2000:1.5, 2001:1.7,2002:3.6}}

In [57]:
frame3 = pd.DataFrame(pop)

In [58]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [59]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [60]:
pd.DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [61]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [62]:
pdata = {'Ohio': frame3['Ohio'][:-1],
        'Nevada':frame3['Nevada'][:2]}

In [63]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [64]:
frame3.index.name = 'year';frame3.columns.name = 'state'

In [65]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [66]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

## Index Objects

In [67]:
obj = pd.Series(range(3), index=['a','b','c'])

In [68]:
obj

a    0
b    1
c    2
dtype: int64

In [69]:
index = obj.index

In [70]:
index

Index(['a', 'b', 'c'], dtype='object')

In [71]:
index[1:]

Index(['b', 'c'], dtype='object')

In [72]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [ ]:
### Index are immutable and can't be modified by user

In [73]:
labels = pd.Index(np.arange(3))

In [74]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [75]:
obj2 = pd.Series([1.5,-2.5,0], index=labels)

In [76]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [77]:
obj2.index is labels

True

In [78]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [79]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [80]:
'Ohio' in frame3.columns

True

In [81]:
'Ohio' in frame3.index

False

In [ ]:
## unlike python sets, a Pandas Index can contain duplicate labels:

In [82]:
dup_labels = pd.Index(['foo','foo','bar','bar'])

In [83]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

## 5.2 Essential Functionality
### Reindexing

In [85]:
obj = pd.Series([4.5,7.2,-5.3,3.6], index=['d','b','a','c'])

In [86]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [87]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [88]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [89]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [90]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [91]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [92]:
frame  = pd.DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'], columns=['Ohio','Texas','California'])

In [93]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [94]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [95]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [96]:
states = ['Texas','Utah','California']

In [97]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [99]:
frame.loc[['a','b','c','d'],states]

/home/talha/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

## Dropping Entries from an Axis

In [100]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [101]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [102]:
new_obj = obj.drop('c')

In [103]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [104]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [105]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [106]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [107]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [108]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [110]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [111]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [113]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [114]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [115]:
obj.drop('c',inplace=True)

In [116]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

##### Be careful with the inplace , as it destroys any data that is dropped.

### Indexing, Selection, and Filtering

In [117]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [118]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [119]:
obj['c']

2.0

In [122]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [123]:
obj[1]

1.0

In [125]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [126]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [127]:
obj[obj <2]

a    0.0
b    1.0
dtype: float64

Slicing with labels behaves differently than normal Python slicing in that the end‐
point is inclusive:

In [128]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [129]:
obj['b':'c'] = 5

In [130]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

Indexing into a DataFrame is for retrieving one or more columns either with a single
value or sequence:

In [131]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=['Ohio', 'Colorado', 'Utah', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [132]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [133]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [134]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [135]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [136]:
data[data['three'] >5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [137]:
data <5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [138]:
data[data<5] = 0

In [139]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection with loc and iloc

In [140]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [141]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [142]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [143]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [144]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [145]:
data.loc['Utah','two']

9

In [147]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [148]:
data.iloc[:,:3][data.three >3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and Data Alignment

In [149]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [150]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

In [151]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [152]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [153]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [154]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),index=['Ohio', 'Texas', 'Colorado'])

In [155]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [156]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [157]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [158]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [159]:
df1 = pd.DataFrame({'A': [1, 2]})

In [160]:
df2 = pd.DataFrame({'B':[3,4]})

In [161]:
df1

   A
0  1
1  2

In [162]:
df2

   B
0  3
1  4

In [163]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

### Arithmetic methods with fill values

In [166]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))

In [167]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list('abcde'))

In [170]:
df2.loc[1,'b'] = np.nan

In [171]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [172]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [173]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [174]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [175]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [176]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [177]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [178]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

In [179]:
arr = np.arange(12.).reshape((3,4))

In [180]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [181]:
arr[0]

array([0., 1., 2., 3.])

In [182]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [183]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [184]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [185]:
series = frame.iloc[0]

In [186]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [187]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [188]:
series2 = pd.Series(range(3), index=['b','e','f'])

In [189]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [190]:
series2

b    0
e    1
f    2
dtype: int64

In [191]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [192]:
series3 = frame['d']

In [193]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [194]:
frame.sub(series3,axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### Function Application and Mapping

In [195]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [196]:
frame

               b         d         e
Utah   -0.319330  1.843507  0.489453
Ohio   -0.857574 -1.462190  0.304079
Texas  -0.078483  0.385135  0.019024
Oregon -1.336691 -0.050575  2.542938

In [197]:
np.abs(frame)

               b         d         e
Utah    0.319330  1.843507  0.489453
Ohio    0.857574  1.462190  0.304079
Texas   0.078483  0.385135  0.019024
Oregon  1.336691  0.050575  2.542938

In [198]:
f = lambda x :x.max() - x.min()

In [199]:
f

In [200]:
frame.apply(f)

b    1.258208
d    3.305697
e    2.523914
dtype: float64

In [201]:
frame.apply(f,axis='columns')

Utah      2.162837
Ohio      1.766269
Texas     0.463618
Oregon    3.879629
dtype: float64

In [202]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [203]:
frame.apply(f)

            b         d         e
min -1.336691 -1.462190  0.019024
max -0.078483  1.843507  2.542938

In [204]:
format = lambda x : '%2f' % x

In [205]:
frame.applymap(format)

                b          d         e
Utah    -0.319330   1.843507  0.489453
Ohio    -0.857574  -1.462190  0.304079
Texas   -0.078483   0.385135  0.019024
Oregon  -1.336691  -0.050575  2.542938

The reason for the name applymap is that Series has a map method for applying an
element-wise function:

In [206]:
frame['e'].map(format)

Utah      0.489453
Ohio      0.304079
Texas     0.019024
Oregon    2.542938
Name: e, dtype: object

### Sorting and Ranking

In [207]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [208]:
obj

d    0
a    1
b    2
c    3
dtype: int64

In [209]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [210]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=['three', 'one'],
                     columns=['d', 'a', 'b', 'c'])

In [211]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [212]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [213]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [215]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [216]:
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [217]:
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [218]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [219]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [220]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [221]:
frame.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [222]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [223]:
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [224]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [225]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [226]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

In [227]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [228]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

### Axis Indexes with Duplicate Labels

In [229]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [230]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [231]:
obj.index.is_unique

False

In [232]:
obj['a']

a    0
a    1
dtype: int64

In [233]:
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [234]:
df

          0         1         2
a  0.947898 -0.698548 -1.489543
a -0.572458  0.362887 -0.664650
b -2.423972  0.879807 -0.101130
b -1.365896  0.959779  0.097688

In [235]:
df.loc['b']

          0         1         2
b -2.423972  0.879807 -0.101130
b -1.365896  0.959779  0.097688

### 5.3 Summarizing and Computing Descriptive Statistics

In [237]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [238]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [239]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [240]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [241]:
df.mean(axis='columns', skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [242]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [243]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [244]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [245]:
import pandas_datareader.data as web

In [246]:
alldata = {ticker: web.get_data_yahoo(ticker)
          for ticker in ['AAPL','IBM',"MSFT",'GOOG']}

In [249]:
price = pd.DataFrame({ticker: data['Adj Close']
                      for ticker, data in alldata.items()})

In [250]:
volume = pd.DataFrame({ticker: data['Volume']
                       for ticker, data in alldata.items()})

In [251]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-04-30  115.170479  137.560608   43.857941   537.340027
2015-05-01  118.667458  139.471954   43.875984   537.900024
2015-05-04  118.437393  139.712860   43.497272   540.780029
2015-05-05  115.768646  138.998123   42.920189   530.799988
2015-05-06  115.041649  137.598297   41.729969   524.219971
...                ...         ...         ...          ...
2020-04-22  276.100006  119.309998  173.520004  1263.209961
2020-04-23  275.029999  121.349998  171.419998  1276.310059
2020-04-24  282.970001  124.720001  174.550003  1279.310059
2020-04-27  283.170013  125.919998  174.050003  1275.880005
2020-04-28  278.579987  126.269997  169.809998  1233.670044

[1258 rows x 4 columns]

In [252]:
returns = price.pct_change()

In [253]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-04-22  0.028804  0.021840  0.033965  0.038534
2020-04-23 -0.003875  0.017098 -0.012102  0.010370
2020-04-24  0.028870  0.027771  0.018259  0.002351
2020-04-27  0.000707  0.009622 -0.002865 -0.002681
2020-04-28 -0.016209  0.002780 -0.024361 -0.033083

In [254]:
returns['MSFT'].corr(returns['IBM'])

0.6005348556665214

In [255]:
returns['MSFT'].cov(returns['IBM'])

0.00016104714494854413

In [256]:
returns.MSFT.corr(returns.IBM)

0.6005348556665214

In [257]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.534219  0.708847  0.642028
IBM   0.534219  1.000000  0.600535  0.530930
MSFT  0.708847  0.600535  1.000000  0.750129
GOOG  0.642028  0.530930  0.750129  1.000000

In [258]:
returns.cov()

          AAPL       IBM      MSFT      GOOG
AAPL  0.000327  0.000151  0.000220  0.000197
IBM   0.000151  0.000244  0.000161  0.000140
MSFT  0.000220  0.000161  0.000294  0.000218
GOOG  0.000197  0.000140  0.000218  0.000286

### Unique Values, Value Counts, and Membership

In [259]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [260]:
uniques = obj.unique()

In [261]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [262]:
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [263]:
pd.value_counts(obj.values, sort=False)

b    2
d    1
c    3
a    3
dtype: int64

In [264]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [265]:
mask = obj.isin(['b','c'])

In [266]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [267]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

# 5.4 Conclusion
# In the next chapter, we’ll discuss tools for reading (or loading) and writing datasets
# with pandas. After that, we’ll dig deeper into data cleaning, wrangling, analysis, and
# visualization tools using pandas.